app/views/admins/index.html.erb

	<%= link_to("+", {:action => 'new'}, :class => 'action new symb') %>
	<%= pluralize(@admins.size, "Admins") %>
---
SELECT COUNT(*) FROM `admins`
SELECT `admins`.* FROM `admins`  ORDER BY admins.first_name ASC