app/views/people/delete.html.erb

SELECT COUNT(*) FROM `works` WHERE `works`.`person_id` = 4
---
<ul>
	<li><%= @person.works.size %></li>