app/views/people/index.html.erb

	<%= link_to("+", {:action => 'new'}, :class => 'action new symb') %>
	<%= pluralize(@people.size, "People") %>
---
SELECT COUNT(*) FROM `people`
SELECT `people`.* FROM `people`  ORDER BY people.position ASC

			<%= person.visible ? 'Visible' : 'Invisible' %>
			<%= person.works.size %>
---
SELECT COUNT(*) FROM `works` WHERE `works`.`person_id` = 1