app/views/people/show.html.erb

<ul>
	<li><%= @person.works.size %></li>
---
SELECT COUNT(*) FROM `works` WHERE `works`.`person_id` = 1