app/views/works/index.html.erb

SELECT COUNT(*) FROM `works`
SELECT `works`.* FROM `works`  ORDER BY works.position ASC
---
	<%= link_to("+", {:action => 'new', :person_id => @person.id}, :class => 'action new symb') %>
	<%= pluralize(@works.size, "Work") %>