app/views/groups/delete.html.erb

<ul>
	<li><%= @group.people.size %></li>
---
SELECT COUNT(*) FROM `people` WHERE `people`.`group_id` = 1