app/views/groups/index.html.erb

	<%= link_to("+", {:action => 'new'}, :class => 'action new symb') %>
	<%= pluralize(@groups.size, "Group") %>
---
SELECT COUNT(*) FROM `groups`
SELECT `groups`.* FROM `groups`  ORDER BY groups.position ASC

			<%= group.visible ? 'Visible' : 'Invisible' %>
			<%= group.people.size %>
---
SELECT COUNT(*) FROM `people` WHERE `people`.`group_id` = 1