app/views/access/index.html.erb

<% @admin_id = session[:admin_id] %>
<% @admin = Admin.find(@admin_id) %>
---
SELECT  `admins`.* FROM `admins` WHERE `admins`.`id` = 4 LIMIT 1