app/views/posts/index.html.erb

	<%= link_to("+", {:action => 'new'}, :class => 'action new symb') %>
	<%= pluralize(@posts.size, "Post") %>
---
SELECT COUNT(*) FROM `posts`
SELECT `posts`.* FROM `posts`  ORDER BY posts.position ASC