app/controllers/access_controller.rb

SELECT  `admins`.* FROM `admins` WHERE `admins`.`id` = 4 LIMIT 1
---
  def index
    @admin = Admin.where(:id => session[:admin_id]).first