app/controllers/access_controller.rb

  def attempt_login
  	if params[:username].present? && params[:password].present?
  		found_user = Admin.where(:username => params[:username]).first
---
SELECT  `admins`.* FROM `admins` WHERE `admins`.`username` = 'corey'  ORDER BY `admins`.`id` ASC LIMIT 1