app/controllers/admins_controller.rb

SELECT  `admins`.* FROM `admins` WHERE `admins`.`id` = 1 LIMIT 1
---
  def show
    @admin = Admin.find(params[:id])

INSERT INTO `admins` (`first_name`, `last_name`, `username`, `password_digest`, `email`, `created_at`, `updated_at`) VALUES ('Admin', 'User', 'adminuser', '$2a$10$qRI0sdO6P8f4twNzv9KCb.SxBqUSlQL4wHIczj5MF3bJuzfAz8ppC', 'a@min.com', '2015-02-13 21:22:12.465929', '2015-02-13 21:22:12.465929')
---
  def create
    @admin = Admin.new(admin_params)
    if @admin.save

SELECT  `admins`.* FROM `admins` WHERE `admins`.`id` = NULL LIMIT 1
---
  def edit
    @admin = Admin.find(params[:id])

SELECT  `admins`.* FROM `admins` WHERE `admins`.`id` = 2 LIMIT 1
UPDATE `admins` SET `email` = 'coreytegeler1@gmail.com', `updated_at` = '2015-02-13 20:27:53.568435' WHERE `admins`.`id` = 4
---
  def update
    @admin = Admin.find(params[:id])
    if @admin.update_attributes(admin_params)

SELECT  `admins`.* FROM `admins` WHERE `admins`.`id` = 1 LIMIT 1
---
  def delete
    @admin = Admin.find(params[:id])

DELETE FROM `admins` WHERE `admins`.`id` = 2
SELECT  `admins`.* FROM `admins` WHERE `admins`.`id` = 2 LIMIT 1
---
  def destroy
    #don't need an instance variable since it is not being called elsewhere
    admin = Admin.find(params[:id]).destroy