app/controllers/groups_controller.rb

  def show
    @group = Group.find(params[:id])
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1

  def create
    @group = Group.new(group_params)
    if @group.save
---
INSERT INTO `groups` (`name`, `slug`, `position`, `visible`, `created_at`, `updated_at`) VALUES ('Students', 'students', 1, 1, '2015-02-13 20:42:20.489691', '2015-02-13 20:42:20.489691')

  def edit
    @group = Group.find(params[:id])
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1

  def update
    @group = Group.find(params[:id])
    if @group.update_attributes(group_params)
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
UPDATE `groups` SET `slug` = 'students', `updated_at` = '2015-02-13 20:42:35.022341' WHERE `groups`.`id` = 1

  def delete
    @group = Group.find(params[:id])
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1

  def destroy
    #don't need an instance variable since it is not being called elsewhere
    group = Group.find(params[:id]).destroy
---
DELETE FROM `groups` WHERE `groups`.`id` = 6
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 6 LIMIT 1