app/controllers/people_controller.rb

  def new
    @person = Person.new
    @people_count = Person.count + 1
    @groups = Group.order('position ASC')
---
SELECT  `groups`.* FROM `groups`  ORDER BY position ASC LIMIT 1

  def create
    @person = Person.new(person_params)
    if @person.save
      flash[:notice] = "#{@person.name} was created!"
      flash[:type] = 'good'
      redirect_to(:action => 'index')
    else
      @people_count = Person.count + 1
      @groups = Group.order('position ASC')
---
SELECT `groups`.* FROM `groups`  ORDER BY position ASC

  def edit
    @person = Person.find(params[:id])
    @people_count = Person.count
    @groups = Group.order('position ASC')
---
SELECT `groups`.* FROM `groups`  ORDER BY position ASC

  def update
    @person = Person.find(params[:id])
    if @person.update_attributes(person_params)
      flash[:notice] = "#{@person.name} was updated!"
      flash[:type] = 'good'
      redirect_to(:action => 'index')
    else
      @people_count = Person.count
      @groups = Group.order('position ASC')
---
SELECT `groups`.* FROM `groups`  ORDER BY position ASC