app/controllers/posts_controller.rb

  def show
    @post = Post.find(params[:id])
    @groups = @post.groups
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
SELECT  `groups`.* FROM `groups` INNER JOIN `groups_posts` ON `groups`.`id` = `groups_posts`.`group_id` WHERE `groups_posts`.`post_id` = 2 AND `groups`.`id` = 1 LIMIT 1

  def new
    @post = Post.new
    @posts_count = Post.count + 1
    @groups = Group.order('position ASC')
---
SELECT COUNT(*) FROM `posts`
SELECT `groups`.* FROM `groups`  ORDER BY groups.position ASC

  def create
    @post = Post.new(post_params)
    if @post.save
      flash[:notice] = "#{@post.title} was created!"
      flash[:type] = 'good'
      redirect_to(:action => 'index')
    else
      @posts_count = Post.count + 1
      @groups = Group.order('position ASC')
---
INSERT INTO `posts` (`title`, `position`, `content`, `created_at`, `updated_at`) VALUES ('Another new post', 2, 'Fuck yes', '2015-02-06 20:41:44.024555', '2015-02-06 20:41:44.024555')
SELECT COUNT(*) FROM `posts`
SELECT `groups`.* FROM `groups`  ORDER BY position ASC

  def edit
    @post = Post.find(params[:id])
    @posts_count = Post.count
    @groups = Group.order('position ASC')
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
SELECT `groups`.* FROM `groups`  ORDER BY groups.position ASC

  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(post_params)
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
UPDATE `posts` SET `content` = 'Hello world!', `updated_at` = '2015-02-06 19:27:51.333650' WHERE `posts`.`id` = 2

  def delete
    @post = Post.find(params[:id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1

  def destroy
    #don't need an instance variable since it is not being called elsewhere
    post = Post.find(params[:id]).destroy
---
DELETE FROM `posts` WHERE `posts`.`id` = 1
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1