app/controllers/works_controller.rb

  def index
    @works = Work.where(:person_id => @person.id)
---
SELECT `works`.* FROM `works` WHERE `works`.`person_id` = 8

  def show
    @work = Work.find(params[:id])
---
SELECT  `works`.* FROM `works` WHERE `works`.`id` = 1 LIMIT 1

  def new
    @work = Work.new({:person_id => @person.id})
    @work_count = Work.count + 1
---
SELECT COUNT(*) FROM `works`

  def create
    @work = Work.new(work_params)
    if @work.save
      flash[:notice] = "#{@work.title} was created!"
      flash[:type] = 'good'
      redirect_to(:action => 'index', :person_id => @person_id)
    else
      @work_count = Work.count + 1
---
INSERT INTO `works` (`title`, `slug`, `position`, `person_id`, `created_at`, `updated_at`) VALUES ('Work #3', '', 1, 9, '2015-02-16 19:35:52.684968', '2015-02-16 19:35:52.684968')
SELECT COUNT(*) FROM `works`

  def edit
    @work = Work.find(params[:id])
    @work_count = Work.count
---
SELECT  `works`.* FROM `works` WHERE `works`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `works`

  def update
    @work = Work.find(params[:id])
    if @work.update_attributes(work_params)
      flash[:notice] = "#{@work.title} was updated!"
      flash[:type] = 'good'
      redirect_to(:action => 'index', :person_id => @person_id)
    else
      @work_count = Work.count
---
SELECT  `works`.* FROM `works` WHERE `works`.`id` = 1 LIMIT 1
UPDATE `works` SET `title` = 'Poster', `updated_at` = '2015-02-06 21:13:28.044323' WHERE `works`.`id` = 1
SELECT COUNT(*) FROM `works`

  def delete
    @work = Work.find(params[:id])
---
SELECT  `works`.* FROM `works` WHERE `works`.`id` = 3 LIMIT 1

  def destroy
    #don't need an instance variable since it is not being called elsewhere
    work = Work.find(params[:id]).destroy
---
DELETE FROM `works` WHERE `works`.`id` = 3
SELECT  `works`.* FROM `works` WHERE `works`.`id` = 3 LIMIT 1