app/views/application/index.html.erb

			<ul class="people">
			<% group.people.each do |person| %>
---
SELECT `people`.* FROM `people` WHERE `people`.`group_id` = 1

				<ul class="people">
				<% person.works.each do |work| %>
---
SELECT `works`.* FROM `works` WHERE `works`.`person_id` = 1